## Data Cleaning Handling Missing Values

In [4]:
import pandas as pd

In [2]:
df = pd.read_csv('nan.csv')

In [3]:
df

    top  high
0  41.0  88.0
1  22.0   NaN
2  45.0   NaN
3  36.0   NaN
4   NaN   NaN
5  21.0   NaN
6  12.0   NaN

In [4]:
df.isnull().sum()

top     1
high    6
dtype: int64

In [5]:
df.shape

(7, 2)

In [6]:
df.isnull().sum()/df.shape[0]

top     0.142857
high    0.857143
dtype: float64

In [7]:
# Drop Column
high_drop=df.drop(['high'], axis=1)

In [8]:
high_drop

    top
0  41.0
1  22.0
2  45.0
3  36.0
4   NaN
5  21.0
6  12.0

In [9]:
high_drop.dropna(inplace=True)

In [10]:
high_drop

    top
0  41.0
1  22.0
2  45.0
3  36.0
5  21.0
6  12.0

In [11]:
df

    top  high
0  41.0  88.0
1  22.0   NaN
2  45.0   NaN
3  36.0   NaN
4   NaN   NaN
5  21.0   NaN
6  12.0   NaN

1st method

In [12]:
df['top']=df['top'].fillna(df['top'].mean())

In [18]:
df

    top  high
0  41.0  88.0
1  22.0   NaN
2  45.0   NaN
3  36.0   NaN
4  29.5   NaN
5  21.0   NaN
6  12.0   NaN

In [5]:
df1 = pd.read_csv('nan2.csv')

In [6]:
df1

      top  high
0    41.0  88.0
1    22.0   NaN
2    45.0   NaN
3    36.0   NaN
4     NaN   NaN
5    21.0   NaN
6  1254.0   NaN

2nd method

In [10]:
df1['top']=df1['top'].fillna(df1['top'].median())

In [11]:
df1

      top  high
0    41.0  88.0
1    22.0   NaN
2    45.0   NaN
3    36.0   NaN
4    38.5   NaN
5    21.0   NaN
6  1254.0   NaN

In [12]:
df2 = pd.read_csv('nan3.csv')

In [13]:
df2

   top  high
0  4.0  88.0
1  5.0   NaN
2  5.0   NaN
3  4.0   NaN
4  NaN   NaN
5  4.0   NaN
6  2.0   NaN

In [15]:
df2['top'].value_counts()

4.0    3
5.0    2
2.0    1
Name: top, dtype: int64

3rd method

In [23]:
df2.interpolate()

   top  high
0  4.0  88.0
1  5.0  88.0
2  5.0  88.0
3  4.0  88.0
4  4.0  88.0
5  4.0  88.0
6  2.0  88.0

In [16]:
df = pd.read_csv('Salaries.csv')

C:\Users\salma\AppData\Local\Temp\ipykernel_4396\2827120379.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('Salaries.csv')

In [17]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [18]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [19]:
df.isnull().sum()/df.shape[0]

Id                  0.000000
EmployeeName        0.000000
JobTitle            0.000000
BasePay             0.004070
OvertimePay         0.000000
OtherPay            0.000000
Benefits            0.243243
TotalPay            0.000000
TotalPayBenefits    0.000000
Year                0.000000
Notes               1.000000
Agency              0.000000
Status              0.743572
dtype: float64

In [20]:
df.drop(['Status','Notes','Benefits'] , axis = 1, inplace=True)

In [55]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,326373.19,326373.19,2011,San Francisco
...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0,0,0,0.00,0.00,2014,San Francisco
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,San Francisco
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,San Francisco
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,San Francisco
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,-618.13,-618.13,2014,San Francisco

In [34]:
df.isnull().sum()

Id                    0
EmployeeName          0
JobTitle              0
BasePay             605
OvertimePay           0
OtherPay              0
TotalPay              0
TotalPayBenefits      0
Year                  0
Agency                0
dtype: int64

In [21]:
df.dropna(inplace=True)

In [36]:
df.isnull().sum()

Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
TotalPay            0
TotalPayBenefits    0
Year                0
Agency              0
dtype: int64

In [50]:
df = pd.read_csv('spam.csv')

In [51]:
df

     email  hacker
0    spam        1
1  no spam       0
2    spam        1
3      NaN       1
4  no spam       0
5  no spam       0
6  no spam       0

In [41]:
df['email'].value_counts()

no spam    4
spam       2
Name: email, dtype: int64

In [63]:
df['email'].fillna(method='ffill')

0      spam
1    no spam
2      spam
3      spam
4    no spam
5    no spam
6    no spam
Name: email, dtype: object

In [64]:
df['email'].fillna(method='bfill')

0      spam
1    no spam
2      spam
3    no spam
4    no spam
5    no spam
6    no spam
Name: email, dtype: object

In [54]:
df['email']=df['email'].fillna('no spam')

In [55]:
df

     email  hacker
0    spam        1
1  no spam       0
2    spam        1
3  no spam       1
4  no spam       0
5  no spam       0
6  no spam       0